TMM_src/DataProcessors/НавигацияАнкетированиеИОпросы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>НавигацияАнкетированиеИОпросы</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

TMM_src/Enums/ВидыАнкетаОпрос.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыАнкетаОпрос</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Анкетирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опрос</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

TMM_src/Catalogs/АнкетыИОпросы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>АнкетыИОпросы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Партнёр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнёры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мероприятие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАнкетаОпрос</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вопросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОтвета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

TMM_src/DataProcessors/НавигацияАнкетированиеИОпросы/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура СоздатьНовуюАнкету(Команда)
	
	ДатаНачала = ТекущаяДата();
	ДатаОкончания = КонецМесяца(ДатаНачала);
	
	ПараметрыОткрытия = Новый Структура;
	ДанныеЗаполнения = Новый Структура("Мероприятие,ДатаНачала,ДатаОкончания",ПредопределенноеЗначение("Перечисление.ВидыАнкетаОпрос.Анкетирование"),ДатаНачала,ДатаОкончания);
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ДанныеЗаполнения);
	ОткрытьФорму("Справочник.АнкетыИОпросы.ФормаОбъекта",ПараметрыОткрытия);
	//Сообщить("Можно создать новую анкету для клиента Почты России");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйОпрос(Команда)
	
	ДатаНачала = ТекущаяДата();
	ДатаОкончания = КонецМесяца(ДатаНачала);
	
	ПараметрыОткрытия = Новый Структура;
	ДанныеЗаполнения = Новый Структура("Мероприятие,ДатаНачала,ДатаОкончания",ПредопределенноеЗначение("Перечисление.ВидыАнкетаОпрос.Опрос"),ДатаНачала,ДатаОкончания);
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ДанныеЗаполнения);
	ОткрытьФорму("Справочник.АнкетыИОпросы.ФормаОбъекта",ПараметрыОткрытия);
	//Сообщить("Позволит создать новые опросы для населения/клиентов Почты России");
	
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьПроведеннныеАнкетыОпросы(Команда)
	
	ОткрытьФорму("Документ.ПроведениеАнкетированияОпросов.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчётыПоРезультатамПроведенияАнкетИОпросо(Команда)
	
	Сообщить("Открывает окошко с выбором аналитических отчётиков по результатам опросов и проведения анкет. Ведь интересно узнать всякое о группах населения.");
	
КонецПроцедуры
